In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("dastasets/ufo.csv")

In [3]:
data.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [4]:
data["Time"]

0          6/1/1930 22:00
1         6/30/1930 20:00
2         2/15/1931 14:00
3          6/1/1931 13:00
4         4/18/1933 19:00
               ...
18236    12/31/2000 23:00
18237    12/31/2000 23:00
18238    12/31/2000 23:45
18239    12/31/2000 23:45
18240    12/31/2000 23:59
Name: Time, Length: 18241, dtype: object

In [5]:
data["Time"]=pd.to_datetime(data["Time"])

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             18216 non-null  object
 1   Colors Reported  2882 non-null   object
 2   Shape Reported   15597 non-null  object
 3   State            18241 non-null  object
 4   Time             18241 non-null  datetime64[ns]
dtypes: datetime64[ns](1), object(4)
memory usage: 712.7+ KB

In [7]:
data["Time"]

0       1930-06-01 22:00:00
1       1930-06-30 20:00:00
2       1931-02-15 14:00:00
3       1931-06-01 13:00:00
4       1933-04-18 19:00:00
                ...
18236   2000-12-31 23:00:00
18237   2000-12-31 23:00:00
18238   2000-12-31 23:45:00
18239   2000-12-31 23:45:00
18240   2000-12-31 23:59:00
Name: Time, Length: 18241, dtype: datetime64[ns]

In [8]:
data["IN_December"]=data["Time"].dt.month

In [9]:
data.head()

,City,Colors Reported,Shape Reported,State,Time,IN_December
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,6
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,6
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00,2
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00,6
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00,4

In [10]:
data["IN_December"]=data["IN_December"]==12

In [11]:
data["IN_December"].replace({True:1,False:0})

0        0
1        0
2        0
3        0
4        0
        ..
18236    1
18237    1
18238    1
18239    1
18240    1
Name: IN_December, Length: 18241, dtype: int64

In [17]:
data.head()

,City,Colors Reported,Shape Reported,State,Time,IN_December
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,False
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,False
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00,False
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00,False
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00,False

In [22]:
import datetime
t=datetime.datetime(1914,7,28)

In [26]:
data['Time_Diff_From_WW1']=data['Time']-t

In [27]:
data['Time_Diff_From_WW1'].head()

0   5787 days 22:00:00
1   5816 days 20:00:00
2   6046 days 14:00:00
3   6152 days 13:00:00
4   6839 days 19:00:00
Name: Time_Diff_From_WW1, dtype: timedelta64[ns]